/***************************************************************************
			
			config.h - Файл конфигурации проекта
			
***************************************************************************/
#ifndef _CONFIG_H_
#define _CONFIG_H_

#define flightRegulatorCFB       // Использовать flightRegulatorCFB регулятор
#define DEBUG_VARS               // Включить вывод отладочной информации (модуль debug.c)
//#define TRACE_SYS_STATE          // Включить трассировку состояния системы в CAN

#endif
