/**************************************************************************************************************

        crc16 - Модуль расчета контрольной суммы.
				
				Метод:     Табличный CRC-16 CCITT 
				Полином:    0x1021    x^16 + x^12 + x^5 + 1			
				Начальное значение: Задается пользователем
				
***************************************************************************************************************/

#ifndef _CRC16_H_
#define _CRC16_H_

#include "stdint.h"

// Начальные значения контрольной суммы при входе в функцию расчета
#define CRC16_INITIAL_FFFF         0xFFFF
#define CRC16_INITIAL_0            0x0000  


/**************************************************************************************************************
                                                                                                              * 
						Crc16 - Функция расчета контрольной суммы  CRC-16 CCITT                                           *
						Полином: 0x1021    x^16 + x^12 + x^5 + 1																													*
						Начальное значение: Задается пользователем                                                        *
						Параметры:                                                                                        *
											pcBlock - Указатель на буффер, для которого ведется расчёт                              *
											len - Длина в байтах                                                                    *
											InitialValue - Начальное значение CRC                                                   *
											                                                                                        * 
**************************************************************************************************************/
uint16_t Crc16(uint8_t * pcBlock, uint16_t len, uint16_t InitialValue);


#endif
