/***************************************************************************
			
  loger - Модуль, задающий формат записи лога
				
***************************************************************************/
#ifndef _LOG_RECORDER_H_
#define _LOG_RECORDER_H_


/************************************************************************************
  loger_initmsg - Запись в лог первичной информации
************************************************************************************/
void loger_initmsg (void);


/************************************************************************************
  loger_periodprint - Функция, определяющая формат записи в лог сообщений
  на каждый шаг алгоритма.
************************************************************************************/
void loger_periodprint(void);


/************************************************************************************
  loger_exitmsg - Запись в лог информации о завершении работы БУП
************************************************************************************/
void loger_exitmsg(void);

#endif
