/***************************************************************************************************

    heightmap.platformdepend - Подмодуль Heightmap, благодаря которому, платформозависимые 
    функции и определения вынесены отдельно. Позволяет проводить отладку в любой среде
    и осуществлять быстрое портирование на любые платформы
		
    Текущее расположение карты высот во внешней памяти по адресам, начиная с нулевого
		
               0| Сведения о карте |55
              56| Высоты по широте |855
             856| Высоты по широте |1655
            1656| Высоты по широте |2455
        ...................................
          319256| Высоты по широте |320055
		
	
    Графически это соответствует:
		
                Долгота
                 /\
                  |
                56| Высоты по широте |855
               856| Высоты по широте |1655
              1656| Высоты по широте |2455
                    .............
            319256| Высоты по широте |320055
    Нуль точка--->0----------------------------> Широта
					 
    При загрузке карты сейчас по адресу 320056 внешней памяти лежит признак загрузки карты
    "OOOO" или в hex 0x4F4F4F4F
    Если память была очищена, либо разметка карты была испорчена, данный признак, будет там отсутствовать.
					 
					 
    Использует: 
        1636PP52Y.h/с     - Драйвер внешней памяти, где располается карта
        MDR32F9Qx_port.h  - Драйвер библиотеки SPL от Миландр
		
***************************************************************************************************/
#ifndef _HEIGHTMAP_PLATFORMDEPEND_
#define _HEIGHTMAP_PLATFORMDEPEND_


/**********************************************************************************
  checkMap - Проверить загружена ли карта и точка приземления
**********************************************************************************/
char checkMap(void);

/**********************************************************************************
  getTouchdownLatitude - Получить широту точки приземления 	
**********************************************************************************/
double getTouchdownLatitude(void);

/**********************************************************************************
  getTouchdownLongitude - Получить долготу точки приземления 
**********************************************************************************/
double getTouchdownLongitude(void);

/**********************************************************************************
  getTouchdownAltitude - Получить высоту раскрытия парашюта 
**********************************************************************************/
double getTouchdownAltitude(void);

/**********************************************************************************
  getNumberOfLatitude - Получить количество узловых точек по широте 
**********************************************************************************/
short getNumberOfLatitude(void);

/**********************************************************************************
  getNumberOfLongitude - Получить количество узловых точек по долготе 
**********************************************************************************/
short getNumberOfLongitude(void);

/**********************************************************************************
  getBottomLeftLatitude - Получить широту нулевой точки 
**********************************************************************************/
double getBottomLeftLatitude(void);

/**********************************************************************************
  getBottomLeftLongitude - Получить долготу нулевой точки 
**********************************************************************************/
double getBottomLeftLongitude(void);

/**********************************************************************************
  getLatitudeGridStep - Получить размер шага по широте 
**********************************************************************************/
double getLatitudeGridStep(void);

/**********************************************************************************
  getLongitudeGridStep - Получить размер шага по долготе 
**********************************************************************************/
double getLongitudeGridStep(void);

/**********************************************************************************
  getAltitudeOnJunctionPoint - Осуществляет поиск высоты в узловой точке с 
  индексами (longitudeIndex, latitudeIndex)
			
  Параметры: 
            longitudeIndex - Индекс по долготе сетки карты от нулевой точки.
            latitudeIndex - Индекс по широте сетки карты от нулевой точки
**********************************************************************************/
short getAltitudeOnJunctionPoint(unsigned int longitudeIndex, unsigned int latitudeIndex);

#endif
