/***************************************************************************************************
		Heightmap_conf_and_pd - Подмодуль Heightmap, благодаря которому, платформозависимые 
		функции и определения вынесены отдельно. Позволяет проводить отладку в любой среде
		и осуществлять быстрое портирование на любые платформы
		
		Текущее расположение карты высот во внешней памяти по адресам, начиная с нулевого
		
		     0| Сведения о карте |53
		    54| Высоты по широте |853
		   854| Высоты по широте |1653
		  1654| Высоты по широте |2453
		...................................
		319254| Высоты по широте |320053
		
	
		Графически это соответствует:
		
		           Долгота
		             /\
		              |
		            54| Высоты по широте |853
		           854| Высоты по широте |1653
		          1654| Высоты по широте |2453
		          .............
		        319254| Высоты по широте |320053
		Нуль точка--->0----------------------------> Широта
					 
		При загрузке карты сейчас по адресу 320054 внешней памяти лежит признак загрузки карты
		"OOOO" или в hex 0x4F4F4F4F
		Если память была очищена, либо разметка карты была испорчена, данный признак, будет там отсутствовать.
					 
					 
		Использует: 
		1636PP52Y.h/с - Драйвер внешней памяти, где располается карта
    MDR32F9Qx_port.h - Драйвер библиотеки SPL от Миладр
***************************************************************************************************/
#ifndef _HEIGHT_MAP_CONF_AND_PD_
#define _HEIGHT_MAP_CONF_AND_PD_


/**********************************************************************************

      CheckMap - Проверить загружена ли карта и точка приземления
			
**********************************************************************************/
char CheckMap(void);

/**********************************************************************************

      GetTouchDownPointLat - Получить широту точки приземления 
			
**********************************************************************************/
double GetTouchDownPointLat(void);



/**********************************************************************************

      GetTouchDownPointLon - Получить долготу точки приземления 
			
**********************************************************************************/
double GetTouchDownPointLon(void);



/**********************************************************************************

      GetMapProperties_LatCount - Получить количество узловых точек по широте 
			
**********************************************************************************/
short GetMapProperties_LatCount(void);



/**********************************************************************************

      GetMapProperties_LonCount - Получить количество узловых точек по долготе 
			
**********************************************************************************/
short GetMapProperties_LonCount(void);



/**********************************************************************************

      GetMapProperties_NullPointLat - Получить широту нулевой точки 
			
**********************************************************************************/
double GetMapProperties_NullPointLat(void);



/**********************************************************************************

      GetMapProperties_NullPointLat - Получить долготу нулевой точки 
			
**********************************************************************************/
double GetMapProperties_NullPointLon(void);



/**********************************************************************************

      GetMapProperties_MapStepLat - Получить размер шага по широте 
			
**********************************************************************************/
double GetMapProperties_MapStepLat(void);



/**********************************************************************************

      GetMapProperties_MapStepLon - Получить размер шага по долготе 
			
**********************************************************************************/
double GetMapProperties_MapStepLon(void);



/**********************************************************************************

      GetMapProperties_Alt - Осуществляет поиск высоты в узловой точке с 
			                       индексами (LON_INDEX, LAT_INDEX)
			
			Параметры: 
			          LON_INDEX - Индекс по долготе сетки карты от нулевой точки.
			          LAT_INDEX - Индекс по широте сетки карты от нулевой точки
								
**********************************************************************************/
short GetMapProperties_Alt(unsigned int LON_INDEX, unsigned int LAT_INDEX);


#endif
