#include "discrete_io.h"

PinConfigType blinkPin;

/**************************************************************************************************************
  Discrete_RetargetPins - Конфигурирование дискретных пинов
**************************************************************************************************************/
void Discrete_RetargetPins (void)
{
  /* Настраиваем пины на вход */
  Pin_init (PIN1);
  Pin_init (BLIND);
  Pin_init (PIN2_DIR);
  Pin_init (PIN2_INV);
  Pin_init (CONNECT_ZPZ);
  /* Настраиваем пины на выход */
  Pin_init (LED_READY);
  Pin_init (LED_FAULT);
  Pin_init (PYRO);
  Pin_init (BLIND_CTRL);
  /* Сбрасываем все выходы в ноль */
  Pin_reset (LED_READY);
  Pin_reset (LED_FAULT);
  Pin_reset (PYRO);
  Pin_reset (BLIND_CTRL);
}

/**************************************************************************************************************
  runIndication - Запуск мигающей индикации
  Параметры:
            pin    - пин с конфигурацией;
            period - период следования импульсов
**************************************************************************************************************/
void runIndication(PinConfigType* pin, unsigned long period)
{
  blinkPin = *pin;                    /* Копируем настройки индикации */
	Pin_reset(blinkPin);                /* Выключаем индикатор */
  Timer_init(BLINK_TIMER, period);    /* Запускаем таймер */
}

/**************************************************************************************************************
  stopIndication - Остановка мигающей индикации
**************************************************************************************************************/
void stopIndication(void)
{
  TIMER_Cmd(BLINK_TIMER, DISABLE);   /* Отключаем таймер */
}

/**************************************************************************************************************
  interruptIndication - Функция обслуживания прерываний от используемого таймера.
  Примечание: 
             Необходимо разместить в базовом обработчике прерывания
**************************************************************************************************************/
void interruptIndication(void)
{
  TIMER_ClearFlag(BLINK_TIMER, TIMER_STATUS_CNT_ARR);	   /* Сбрасываем флаг прерываний таймера */
  if (Pin_read(blinkPin))                                /* Сменяем состояние индикатора на противоположное */
    Pin_reset(blinkPin);
  else 
    Pin_set(blinkPin);                            
}
